# **11. 여러 기준으로 정렬하기(250120)(SELECT)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 모든 동물의 아이디와 이름, 보호 시작일을 이름 순으로 조회하는 SQL문을 작성해주세요.
# 단, 이름이 같은 동물 중에서는 보호를 나중에 시작한 동물을 먼저 보여줘야 합니다.

# 예시
# 예를 들어, ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A349996	Cat	2018-01-22 14:32:00	Normal	Sugar	Neutered Male
# A350276	Cat	2017-08-13 13:50:00	Normal	Jewel	Spayed Female
# A396810	Dog	2016-08-22 16:13:00	Injured	Raven	Spayed Female
# A410668	Cat	2015-11-19 13:41:00	Normal	Raven	Spayed Female
# 이름을 사전 순으로 정렬하면 다음과 같으며, 'Jewel', 'Raven', 'Sugar'
# 'Raven'이라는 이름을 가진 개와 고양이가 있으므로, 이 중에서는 보호를 나중에 시작한 개를 먼저 조회합니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME	DATETIME
# A350276	Jewel	2017-08-13 13:50:00
# A396810	Raven	2016-08-22 16:13:00
# A410668	Raven	2015-11-19 13:41:00
# A349996	Sugar	2018-01-22 14:32:00

1) 내가 쓴 코드

In [ ]:
# SELECT ANIMAL_ID, NAME, DATETIME
# FROM ANIMAL_INS
# ORDER BY NAME ASC, DATETIME DESC

# **12. 어린 동물 찾기(250121)**(SELECT)

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 중 젊은 동물1의 아이디와 이름을 조회하는 SQL 문을 작성해주세요. 이때 결과는 아이디 순으로 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A365172	Dog	2014-08-26 12:53:00	Normal	Diablo	Neutered Male
# A367012	Dog	2015-09-16 09:06:00	Sick	Miller	Neutered Male
# A365302	Dog	2017-01-08 16:34:00	Aged	Minnie	Spayed Female
# A381217	Dog	2017-07-08 09:41:00	Sick	Cherokee	Neutered Male
# 이 중 젊은 동물은 Diablo, Miller, Cherokee입니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME
# A365172	Diablo
# A367012	Miller
# A381217	Cherokee

In [ ]:
# SELECT ANIMAL_ID, NAME
# FROM ANIMAL_INS
# WHERE NOT INTAKE_CONDITION = 'Aged'
# ORDER BY ANIMAL_ID

# **13. 최솟값 구하기(250122)(SUM, MAX, MIN)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 가장 먼저 들어온 동물은 언제 들어왔는지 조회하는 SQL 문을 작성해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A399552	Dog	2013-10-14 15:38:00	Normal	Jack	Neutered Male
# A379998	Dog	2013-10-23 11:42:00	Normal	Disciple	Intact Male
# A370852	Dog	2013-11-03 15:04:00	Normal	Katie	Spayed Female
# A403564	Dog	2013-11-18 17:03:00	Normal	Anna	Spayed Female
# 가장 먼저 들어온 동물은 Jack이고, Jack은 2013-10-14 15:38:00에 들어왔습니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# 시간
# 2013-10-14 15:38:00
# ※ 컬럼 이름(위 예제에서는 "시간")은 일치하지 않아도 됩니다.

In [ ]:
# SELECT MIN(DATETIME)
# FROM ANIMAL_INS
# ORDER BY DATETIME

# **14. 이름이 없는 동물의 아이디(250123)(IS NULL)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 중, 이름이 없는 채로 들어온 동물의 ID를 조회하는 SQL 문을 작성해주세요. 단, ID는 오름차순 정렬되어야 합니다.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A368930	Dog	2014-06-08 13:20:00	Normal	NULL	Spayed Female
# A524634	Dog	2015-01-02 18:54:00	Normal	*Belle	Intact Female
# A465637	Dog	2017-06-04 08:17:00	Injured	*Commander	Neutered Male
# 이름이 없는 채로 들어온 동물의 ID는 A368930입니다. 따라서 SQL을 실행하면 다음과 같이 출력되어야 합니다.

# ANIMAL_ID
# A368930

In [ ]:
# SELECT ANIMAL_ID
# FROM ANIMAL_INS
# WHERE NAME IS NULL
# ORDER BY ANIMAL_ID

# **15. 동명 동물 수 찾기(250127)(GROUP BY)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 이름 중 두 번 이상 쓰인 이름과 해당 이름이 쓰인 횟수를 조회하는 SQL문을 작성해주세요.
# 이때 결과는 이름이 없는 동물은 집계에서 제외하며, 결과는 이름 순으로 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A396810	Dog	2016-08-22 16:13:00	Injured	Raven	Spayed Female
# A377750	Dog	2017-10-25 17:17:00	Normal	Lucy	Spayed Female
# A355688	Dog	2014-01-26 13:48:00	Normal	Shadow	Neutered Male
# A399421	Dog	2015-08-25 14:08:00	Normal	Lucy	Spayed Female
# A400680	Dog	2017-06-17 13:29:00	Normal	Lucy	Spayed Female
# A410668	Cat	2015-11-19 13:41:00	Normal	Raven	Spayed Female
# Raven 이름은 2번 쓰였습니다.
# Lucy 이름은 3번 쓰였습니다
# Shadow 이름은 1번 쓰였습니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# NAME	COUNT
# Lucy	3
# Raven	2

1) 내 코드

In [ ]:
# SELECT NAME, COUNT(NAME) as COUNT
# FROM ANIMAL_INS
# WHERE NAME IS NOT NULL
# GROUP BY NAME
# HAVING COUNT(NAME) >= 2
# ORDER BY NAME